In [2]:
import pandas as pd

In [5]:
data_list = [
    ["소라", 25, "인천"],
    ["청춘", 30, "순천"],
    ["영미", 35, "동해"],
]
print(type(data_list))

columns = ["이름", "나이", "거주지"]

df = pd.DataFrame(data_list, columns=columns)

print(df)
print(type(df))

<class 'list'>
   이름  나이 거주지
0  소라  25  인천
1  청춘  30  순천
2  영미  35  동해
<class 'pandas.core.frame.DataFrame'>

In [7]:
# 02 파일을 데이터 프레임으로 가져오기 

import pandas as pd

df = pd.read_excel("sales_data.xlsx")
print(df)
print(type(df))

           날짜  제품명  판매량    단가    총판매액
0  2023-01-01  제품A  100  1200  120000
1  2023-01-02  제품B  150  1500  225000
2  2023-01-03  제품C  200  1300  260000
3  2023-01-04  제품D  170  1600  272000
<class 'pandas.core.frame.DataFrame'>

In [10]:
# 03 데이터프레임을 파일로 저장하기 

import pandas as pd

data = [
    [1, "파이썬 프로그래밍", "김파이썬", 2019],
    [2, "데이터분석", "이데이터", 2019],
    [3, "머신러닝 입문", "김파이썬", 2018],
    [4, "인공지능의 이해", "김파이썬", 2021],
]
columns = ["도서ID", "도서명", "저자", "출판년도"]
books_df = pd.DataFrame(data, columns=columns)

books_df.to_excel("도서_데이터.xlsx")
books_df

   도서ID        도서명    저자  출판년도
0     1  파이썬 프로그래밍  김파이썬  2019
1     2      데이터분석  이데이터  2019
2     3    머신러닝 입문  김파이썬  2018
3     4   인공지능의 이해  김파이썬  2021

In [14]:
# shape, columns 속성으로 데이터 정보 파악

import pandas as pd

data_list = [
    ["소라", 25, "인천"],
    ["청춘", 30, "순천"],
    ["영미", 35, "동해"],
]
columns = ["이름", "나이", "거주지"]
df = pd.DataFrame(data_list, columns=columns)

print(df.shape)
print(df.columns)
print(len(df.columns))

(3, 3)
Index(['이름', '나이', '거주지'], dtype='object')
3

In [17]:
# head(), tail() 데이터 엿보기

import pandas as pd

data_list = [
    ["소라", 25, "인천"],
    ["청춘", 30, "순천"],
    ["영미", 35, "동해"],
    ["소라", 25, "인천"],
    ["청춘", 30, "순천"],
    ["영미", 35, "동해"],
    ["소라", 25, "인천"],
    ["청춘", 30, "순천"],
    ["영미", 35, "동해"],
]
columns = ["이름", "나이", "거주지"]
df = pd.DataFrame(data_list, columns=columns)
print(df.shape)

print(df.head())
print(df.tail())

(9, 3)
   이름  나이 거주지
0  소라  25  인천
1  청춘  30  순천
2  영미  35  동해
3  소라  25  인천
4  청춘  30  순천
   이름  나이 거주지
4  청춘  30  순천
5  영미  35  동해
6  소라  25  인천
7  청춘  30  순천
8  영미  35  동해

In [19]:
print(df.head(2))
print(df.tail(2))

   이름  나이 거주지
0  소라  25  인천
1  청춘  30  순천
   이름  나이 거주지
7  청춘  30  순천
8  영미  35  동해

In [22]:
# 열 이름 또는 인덱스로 데이터 선택하기 

data_list = [
    ["소라", 25, "인천"],
    ["청춘", 30, "순천"],
    ["영미", 35, "동해"],
    ["소라", 25, "인천"],
    ["청춘", 30, "순천"],
    ["영미", 35, "동해"],
    ["소라", 25, "인천"],
    ["청춘", 30, "순천"],
    ["영미", 35, "동해"],
]
columns = ["이름", "나이", "도시"]
df = pd.DataFrame(data_list, columns=columns)

column_data = df["도시"]
print(type(column_data))
print(column_data)

<class 'pandas.core.series.Series'>
0    인천
1    순천
2    동해
3    인천
4    순천
5    동해
6    인천
7    순천
8    동해
Name: 도시, dtype: object

In [25]:
selected_columns = df[["도시", "이름"]]
print(type(selected_columns))
print(selected_columns)

<class 'pandas.core.frame.DataFrame'>
   도시  이름
0  인천  소라
1  순천  청춘
2  동해  영미
3  인천  소라
4  순천  청춘
5  동해  영미
6  인천  소라
7  순천  청춘
8  동해  영미

In [26]:
# 행선택하기

import pandas as pd 
data_list = [
    ["소라", 25, "인천"],
    ["청춘", 30, "순천"],
    ["영미", 35, "동해"],
    ["소라", 25, "인천"],
    ["청춘", 30, "순천"],
    ["영미", 35, "동해"],
    ["소라", 25, "인천"],
    ["청춘", 30, "순천"],
    ["영미", 35, "동해"],
]
columns = ["이름", "나이", "도시"]
df = pd.DataFrame(data_list, columns=columns)
print(df)

   이름  나이  도시
0  소라  25  인천
1  청춘  30  순천
2  영미  35  동해
3  소라  25  인천
4  청춘  30  순천
5  영미  35  동해
6  소라  25  인천
7  청춘  30  순천
8  영미  35  동해

In [28]:
row = df.loc[0]
print(row)
print(type(row))

이름    소라
나이    25
도시    인천
Name: 0, dtype: object
<class 'pandas.core.series.Series'>

In [30]:
# 인덱싱
selected_rows1 = df.loc[[0, 2]]
print(selected_rows1)
print(type(selected_rows1))

   이름  나이  도시
0  소라  25  인천
2  영미  35  동해
<class 'pandas.core.frame.DataFrame'>

In [32]:
# 슬라이싱
selected_rows2 = df.loc[1:4]
print(selected_rows2)

   이름  나이  도시
1  청춘  30  순천
2  영미  35  동해
3  소라  25  인천
4  청춘  30  순천

In [36]:
selected_columns = df.loc[1:4, "도시"]

print(selected_columns)

1    순천
2    동해
3    인천
4    순천
Name: 도시, dtype: object

In [37]:
selected_columns1 = df.loc[:, ["도시", "이름"]]
print(selected_columns1)

   도시  이름
0  인천  소라
1  순천  청춘
2  동해  영미
3  인천  소라
4  순천  청춘
5  동해  영미
6  인천  소라
7  순천  청춘
8  동해  영미

In [38]:
selected_columns2 = df.loc[1:5, "나이":"도시"]
print(selected_columns2)

   나이  도시
1  30  순천
2  35  동해
3  25  인천
4  30  순천
5  35  동해

In [39]:
selected_value = df.loc[0, "이름"]
print(selected_value)

소라

In [40]:
# iloc[]

import pandas as pd 
data_list = [
    ["소라", 25, "인천"],
    ["청춘", 30, "순천"],
    ["영미", 35, "동해"],
    ["소라", 25, "인천"],
    ["청춘", 30, "순천"],
    ["영미", 35, "동해"],
    ["소라", 25, "인천"],
    ["청춘", 30, "순천"],
    ["영미", 35, "동해"],
]
columns = ["이름", "나이", "도시"]
df = pd.DataFrame(data_list, columns=columns)
print(df)

   이름  나이  도시
0  소라  25  인천
1  청춘  30  순천
2  영미  35  동해
3  소라  25  인천
4  청춘  30  순천
5  영미  35  동해
6  소라  25  인천
7  청춘  30  순천
8  영미  35  동해

In [41]:
row1= df.iloc[0]
row2= df.loc[0]


print(row1)
print(row2)

이름    소라
나이    25
도시    인천
Name: 0, dtype: object
이름    소라
나이    25
도시    인천
Name: 0, dtype: object

In [42]:
df.iloc[:, 1]

0    25
1    30
2    35
3    25
4    30
5    35
6    25
7    30
8    35
Name: 나이, dtype: int64

In [43]:
last_column = df.iloc[:, -1]
print(last_column)

0    인천
1    순천
2    동해
3    인천
4    순천
5    동해
6    인천
7    순천
8    동해
Name: 도시, dtype: object

In [45]:
rows_iloc1 = df.iloc[0:2]
rows_iloc2 = df.loc[0:2]

print(rows_iloc1)
print(rows_iloc2)

   이름  나이  도시
0  소라  25  인천
1  청춘  30  순천
   이름  나이  도시
0  소라  25  인천
1  청춘  30  순천
2  영미  35  동해

In [46]:
df.iloc[:, 1:2]

   나이
0  25
1  30
2  35
3  25
4  30
5  35
6  25
7  30
8  35

In [47]:
rows_list = df.iloc[[0, 2]]
print(rows_list)

   이름  나이  도시
0  소라  25  인천
2  영미  35  동해

In [48]:
columns_list = df.iloc[:, [0, 2]]
print(columns_list)

   이름  도시
0  소라  인천
1  청춘  순천
2  영미  동해
3  소라  인천
4  청춘  순천
5  영미  동해
6  소라  인천
7  청춘  순천
8  영미  동해

In [49]:
# 슬라이싱

selected_rows = df[0:2]
print(selected_rows)

   이름  나이  도시
0  소라  25  인천
1  청춘  30  순천

In [50]:
## 조건으로 특정데이터 필터링
print(df)

   이름  나이  도시
0  소라  25  인천
1  청춘  30  순천
2  영미  35  동해
3  소라  25  인천
4  청춘  30  순천
5  영미  35  동해
6  소라  25  인천
7  청춘  30  순천
8  영미  35  동해

In [51]:
filtered_rows2 = df[df["나이"] >= 30]
filtered_rows2

   이름  나이  도시
1  청춘  30  순천
2  영미  35  동해
4  청춘  30  순천
5  영미  35  동해
7  청춘  30  순천
8  영미  35  동해

In [53]:
condition = (df["나이"] >= 30) & (df["도시"] != "서울")

filtered_row3 = df[condition]

print(filtered_row3)

   이름  나이  도시
1  청춘  30  순천
2  영미  35  동해
4  청춘  30  순천
5  영미  35  동해
7  청춘  30  순천
8  영미  35  동해

In [58]:
조건 = df["도시"].isin(["인천"])
df[조건]

   이름  나이  도시
0  소라  25  인천
3  소라  25  인천
6  소라  25  인천

In [55]:
df

   이름  나이  도시
0  소라  25  인천
1  청춘  30  순천
2  영미  35  동해
3  소라  25  인천
4  청춘  30  순천
5  영미  35  동해
6  소라  25  인천
7  청춘  30  순천
8  영미  35  동해